---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.InvalidConnectionsHaveBeenDisconnected
source: html/59c137b8-4f27-a6aa-d066-8dad1253a224.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.InvalidConnectionsHaveBeenDisconnected Property

Invalid connections have been disconnected. Please reconnect them manually or use different fittings.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidConnectionsHaveBeenDisconnected { get; }
```